"use client";

import Image from "next/image";
import "./style.css";
import { IoIosArrowDown } from "react-icons/io";
import { useState } from "react";

export const faqItems = [
  {
    title: "Що входить у первинну консультацію стоматолога?",
    content: `Під час консультації лікар уточнює скарги, попередній досвід лікування та побажання пацієнта, проводить огляд зубів і ясен, оцінює прикус та загальний стан ротової порожнини. За потреби призначають прицільний знімок або додаткову діагностику.

Після огляду лікар пояснює виявлені проблеми, можливі варіанти лікування та подальші кроки. Остаточний план і точну вартість можна визначити після виконання всіх необхідних діагностичних даних.`,
  },
  {
    title: "Скільки коштує лікування зубів і від чого залежить ціна?",
    content: `Найточнішу ціну можна визначити лише після огляду та діагностики. Після консультації лікар складає індивідуальний план лікування та пояснює всі етапи і їхню вартість.`,
  },
  {
    title: "Чи боляче лікувати зуби та яку анестезію використовують?",
    content: `Сучасна стоматологія дозволяє проводити лікування максимально комфортно та безболісно.

Перед початком лікування лікар підбирає анестезію індивідуально, враховуючи стан здоров’я пацієнта, вид втручання та можливі протипоказання. Перед ін’єкцією на ясна наноситься спеціальний анестезувальний гель, який зменшує відчуття від самого уколу.

Під час лікування пацієнт, як правило, відчуває лише легкий тиск або вібрацію, але не біль. Якщо під час процедури виникає будь-який дискомфорт, достатньо повідомити про це лікаря — анестезію можна додатково посилити.

У нашій практиці використовуються сучасні місцеві анестетики, які забезпечують швидкий початок дії, ефективне знеболення та добре переносяться більшістю пацієнтів.

Після завершення лікування оніміння зазвичай зберігається ще 1–3 години, після чого чутливість поступово повністю відновлюється.`,
  },
  {
    title:
      "Коли достатньо пломби, а коли потрібне лікування кореневих каналів?",
    content: `Це одне з найпоширеніших запитань пацієнтів. Відповідь залежить від того, наскільки глибоко карієс уразив зуб.

Коли достатньо пломби?

Пломба встановлюється, якщо карієс пошкодив лише емаль і дентин, але зубний нерв (пульпа) залишається здоровим. Після видалення уражених тканин зуб відновлюють сучасним пломбувальним матеріалом.

Ознаки:
- короткочасна чутливість на холодне, гаряче або солодке;
- біль швидко минає після усунення подразника;
- на рентгенівському знімку немає ознак ураження кореневих каналів.

Коли необхідне лікування кореневих каналів?

Якщо інфекція проникла до пульпи, простого встановлення пломби вже недостатньо. У такому випадку необхідно видалити інфіковану тканину з кореневих каналів, ретельно їх очистити, продезінфікувати та герметично запломбувати.

Ознаки:
- сильний або пульсуючий біль, особливо вночі;
- тривалий біль після гарячого чи холодного;
- біль при надкушуванні;
- набряк ясен або поява свища;
- зміни біля верхівки кореня на рентгенівському знімку.

Чому важливо не відкладати лікування?

На ранній стадії проблему часто можна вирішити звичайною пломбою. Якщо ж відкладати візит до стоматолога, карієс може дійти до нерва, і тоді лікування стане більш складним, тривалим і дорогим.

Найкращий спосіб зберегти зуб здоровим — проходити профілактичний огляд кожні 6 місяців. Це дозволяє виявити карієс на ранньому етапі та уникнути лікування кореневих каналів.`,
  },
  {
    title:
      "Що краще для відновлення відсутнього зуба: імплант, міст чи знімний протез?",
    content: `Втрата навіть одного зуба може вплинути не лише на естетику посмішки, а й на жування, дикцію та здоров’я сусідніх зубів. Сучасна стоматологія пропонує кілька варіантів відновлення, і вибір залежить від клінічної ситуації, стану кісткової тканини та побажань пацієнта.

Дентальний імплант

Імплант — це титановий корінь, який встановлюється в кістку щелепи, а зверху фіксується коронка.

Переваги:
- не потрібно обточувати сусідні здорові зуби;
- максимально природний вигляд і комфорт;
- допомагає зберегти кісткову тканину;
- за належного догляду може служити багато років.

Зубний міст

Міст — це незнімна конструкція, яка фіксується на сусідніх зубах.

Переваги:
- швидше лікування порівняно з імплантацією;
- не потребує хірургічного втручання;
- гарний естетичний результат.

Особливість: для встановлення моста необхідно обточити сусідні зуби, навіть якщо вони здорові.

Знімний протез

Знімний протез використовується при відсутності одного або кількох зубів, а також коли імплантація або незнімне протезування тимчасово чи постійно неможливі.

Переваги:
- найдоступніший за вартістю варіант;
- дозволяє відновити жувальну функцію навіть при значній втраті зубів;
- виготовляється у відносно короткі терміни.

Особливість: потребує періоду звикання та регулярного догляду.

Який варіант найкращий?

У більшості випадків дентальний імплант є найбільш фізіологічним способом відновлення втраченого зуба, адже він відновлює функцію кореня, не навантажує сусідні зуби та допомагає запобігти атрофії кісткової тканини.

Однак найкраще рішення завжди приймається після огляду, рентгенологічного обстеження або комп’ютерної томографії та детального обговорення з лікарем. Саме індивідуальний підхід дозволяє обрати оптимальний метод лікування для кожного пацієнта.`,
  },
  {
    title: "Що обрати для вирівнювання зубів: брекети чи елайнери?",
    content: `Сучасна ортодонтія пропонує два ефективні способи вирівнювання зубів — брекет-системи та елайнери. Обидва методи допомагають створити красиву посмішку та правильний прикус, але кожен має свої особливості.

Брекет-система

Брекети — це незнімна ортодонтична конструкція, яка фіксується на зубах і поступово переміщує їх у правильне положення.

Переваги:
- ефективні навіть у складних клінічних випадках;
- працюють безперервно, оскільки постійно знаходяться на зубах;
- дозволяють виправити значні порушення прикусу та положення зубів.

Особливість: потребують ретельної гігієни порожнини рота та регулярних візитів до ортодонта для активації.

Елайнери

Елайнери — це прозорі знімні капи, які виготовляються індивідуально та поступово переміщують зуби.

Переваги:
- майже непомітні під час носіння;
- легко знімаються під час їжі та чищення зубів;
- забезпечують комфорт і полегшують щоденну гігієну.

Особливість: для досягнення бажаного результату елайнери необхідно носити 20–22 години на добу. Успіх лікування значною мірою залежить від дисципліни пацієнта.

Що краще саме для вас?

Вибір залежить від:
- складності ортодонтичної проблеми;
- стану зубів і ясен;
- способу життя та професії;
- естетичних побажань;
- рекомендацій лікаря-ортодонта.

Після клінічного огляду, фотопротоколу, рентгенологічного обстеження та аналізу моделей зубів лікар запропонує оптимальний варіант лікування саме для вас.

Головне пам’ятати: найкраща ортодонтична система — це та, яка правильно підібрана для вашої клінічної ситуації та сумлінно виконується пацієнтом. Саме це забезпечує здоровий прикус, гармонійну посмішку та довготривалий результат.`,
  },
];

export function Faq() {
  const [activeQuestion, setActiveQuestion] = useState(0);
  return (
    <section className="faq" id="faq">
      <div className="container">
        <div className="faq-left-img">
          <Image
            src={"/Faq/main.webp"}
            width={1000}
            height={1000}
            alt="Фото кабінету"
          />
        </div>
        <div className="faq-right-content">
          <div className="faq-right-content-top">
            <div className="line"></div>
            <p>FAQ</p>
          </div>
          <div className="faq-right-content-top-text">
            <h2 className="faq-right-content-top-text-title">
              <span>Відповіді​​</span>
              на <br /> поширенні запитання
            </h2>
            <p className="faq-right-content-top-text-description">
              Зібрали відповіді про консультацію, діагностику, вартість,
              гарантії та підготовку до першого візиту.
            </p>
          </div>
          <div className="faq-right-content-questions">
            {faqItems.map((item, i) => (
              <div
                className="faq-right-content-question-card"
                key={i}
                onClick={() => setActiveQuestion(i)}
              >
                <div className="faq-right-content-question-card-top">
                  <h3 className="faq-right-content-question-card-top-title">
                    {item.title}
                  </h3>
                  <IoIosArrowDown
                    className={`price-left-card-top-right-icon ${activeQuestion == i ? "active" : ""}`}
                  />
                </div>
                <div
                  className={`faq-right-content-question-card-text ${activeQuestion == i ? "active" : ""}`}
                  style={{ whiteSpace: "pre-line" }}
                >
                  <p>{item.content}</p>
                </div>
              </div>
            ))}
          </div>
        </div>
      </div>
    </section>
  );
}
